EDT/УТ/src/Documents/ПередачаЗаказовНаВозврат_КУдалению/ПередачаЗаказовНаВозврат_КУдалению.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПередачаЗаказовНаВозврат_КУдалению</name>
  <attributes>
    <name>ТерминалОбработки</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗаказыНеПоМестам</name>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоМест</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МестСобрано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗаказыПоМестам</name>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>Место</name>
      <type>
        <types>CatalogRef.МестаПоЗаказам</types>
      </type>
    </attributes>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Собрано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/InformationRegisters/ШтрихкодыЗаказов/ШтрихкодыЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ШтрихкодыЗаказов</name>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерМеста</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументТСД</name>
    <type>
      <types>DocumentRef.ЗагрузкаСТСД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ШКПереданПартнером</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/ПараметрыКонтрагентов/ПараметрыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыКонтрагентов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ЗапретЧастичногоВыкупа</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗапретСменыОплаты</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВремяОжиданияПриЗабореТовара</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВычисляемыйЗапретЧастичногоВыкупа</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПриёмИтогоСКлиента</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>МетодОплатыПодъёма</name>
    <type>
      <types>EnumRef.МетодыОплатыПодъёмаЗаказа</types>
    </type>
  </resources>
  <resources>
    <name>ЗапретУстановкиСуммыПодъемаВодителюБольшеВыставленной</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПредварительноеЗакрытиеЗаказов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВесЗапросаДанныхОПодъемеОтВодителя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НаименованиеЛатиницей</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОперативнаяПриемка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТипОперативнойПриемки</name>
    <type>
      <types>EnumRef.ТипыОперативнойПриемки</types>
    </type>
  </resources>
  <resources>
    <name>УчетЗаказовПоМестам</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УчетШКПоТоварам</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СкладскаяОбработкаОтсутствует</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>АгрегироватьДанныеВОтправляемыхОтчетах</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СвязкаНастройкиПечатиЧеков</name>
    <type>
      <types>CatalogRef.СвязкиККМ</types>
    </type>
  </resources>
  <resources>
    <name>СпособыКонтроляДнейЗадолженности</name>
    <type>
      <types>EnumRef.СпособыКонтроляДнейЗадолженности</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоДнейДоПросрочкиДолга</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЭтоАгрегатор</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Спецсчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТипОтношенийСКлиентами</name>
    <type>
      <types>EnumRef.ВариантыПечатиОтчетовАгента</types>
    </type>
  </resources>
  <resources>
    <name>setiingId_Strizh</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>login_Strizh</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>password_Strizh</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УчетТоваровПоМестам</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПечатьПредоплаченныхЧеков</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>АвтоматическоеИсключениеМестЗаказаПриПогрузкеВАвто</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьКодИдентификацииКлиента</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НазначениеКодаИдентификацииКлиентаИССтрижа</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>АвтоматическоеИсключениеЧастичноПринятыхНаСкладЗаказовПриПогрузкеВАвто</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеСоздаватьМестаЗаказовПоПриходнымАПП</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОбновлятьКоличествоМестЗаказовПриВыгрузкеАПП</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОдинаковыеШКНаВсехМестахЗаказа</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтключитьПроверкуБНЗаказов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТарифПримерки</name>
    <type>
      <types>CatalogRef.ТарифыПримерка</types>
    </type>
  </resources>
  <resources>
    <name>ОтправкаСсылкиЛКПолучателяЗаказаНаEmail</name>
    <type>
      <types>EnumRef.ВариантыОтправкиСсылокЛКПолучателейЗаказов</types>
    </type>
  </resources>
  <resources>
    <name>ОтправкаСсылкиЛКПолучателяЗаказаSMS</name>
    <type>
      <types>EnumRef.ВариантыОтправкиСсылокЛКПолучателейЗаказов</types>
    </type>
  </resources>
  <resources>
    <name>ШаблонSMSОтправкиСсылкиЛКПолучателяЗаказа</name>
    <type>
      <types>CatalogRef.ШаблоныСМСРассылок</types>
    </type>
  </resources>
  <resources>
    <name>СопроводительныеДокументыНаходятсяВКоробке</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>БезусловнаяПечатьБланковЗаказов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>accessKey</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЛьготнаяКатегорияЭквайринга</name>
    <type>
      <types>CatalogRef.ЛьготныеКатегорииЭквайринга</types>
    </type>
  </resources>
  <resources>
    <name>ПроизводитьРассылкуКонтроляЗаказов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ФормироватьАПП</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВремяФормированияАПП</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОператорРассылки</name>
    <type>
      <types>CatalogRef.ОператорыСМСРассылки</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Catalogs/МестаПоЗаказам/МестаПоЗаказам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МестаПоЗаказам</name>
  <attributes>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерМеста</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторМеста</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеАктуальное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

EDT/УТ/src/Documents/ПередачаЗаказовНаВозврат_КУдалению/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	Если Объект.ТерминалОбработки.Пустая() Тогда	
		Объект.ТерминалОбработки = ПараметрыСеанса.ТерминалДоставки;
		Если Объект.ТерминалОбработки.Пустая() Тогда		
			Объект.ТерминалОбработки = ПредопределенноеЗначение("Справочник.РегиональныеТерминалы.МоскваСтриж");			
		КонецЕсли;
	КонецЕсли;
	
	Если Объект.Ответственный.Пустая() Тогда
		Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;	
	КонецЕсли;
	
	
	ЭтаФорма.ТолькоПросмотр = Объект.Проведен;	

	
КонецПроцедуры


&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	Если Объект.Проведен Тогда
		#Если Клиент Тогда
			Сообщить("Документ проведен");
		#КонецЕсли		
		Возврат;		
	КонецЕсли;
	
	
	Если НЕ Источник = "Сканер штрихкода" Тогда
		Возврат;
	КонецЕсли;		
  
	Если НЕ ЗначениеЗаполнено(Данные) Тогда
		Возврат;
	КонецЕсли;
	
	ОбработатьШКНаСервере(СокрЛП(Данные));
	
	
КонецПроцедуры


Процедура ОбработатьШКНаСервере(Штрихкод)
	
	
	Если Лев(Штрихкод, 2) = "37" И СтрДлина(Штрихкод) = 13 И СтрНайти(Штрихкод, "-") = 0 Тогда
		Штрихкод = Лев(Штрихкод, СтрДлина(Штрихкод) - 1);	
	Иначе
	КонецЕсли;
	
	Заказ = Неопределено;
	
	Запрос = новый Запрос("ВЫБРАТЬ
	                      |	ШтрихкодыЗаказов.Заказ КАК Заказ,
	                      |	1 КАК Приоритет
	                      |ПОМЕСТИТЬ ВТ
	                      |ИЗ
	                      |	РегистрСведений.ШтрихкодыЗаказов КАК ШтрихкодыЗаказов
	                      |ГДЕ
	                      |	ШтрихкодыЗаказов.Штрихкод = &Штрихкод
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	РеализацияТоваровУслуг.Ссылка,
	                      |	2
	                      |ИЗ
	                      |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	                      |ГДЕ
	                      |	РеализацияТоваровУслуг.НомерВнешнегоЗаказа = &Штрихкод
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	РеализацияТоваровУслуг.Ссылка,
	                      |	3
	                      |ИЗ
	                      |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	                      |ГДЕ
	                      |	РеализацияТоваровУслуг.Номер = &Штрихкод
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТ.Заказ КАК Заказ,
	                      |	ЕСТЬNULL(ПараметрыКонтрагентовСрезПоследних.УчетЗаказовПоМестам, ЛОЖЬ) КАК УчетПоМестам
	                      |ИЗ
	                      |	ВТ КАК ВТ
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыКонтрагентов.СрезПоследних КАК ПараметрыКонтрагентовСрезПоследних
	                      |		ПО ВТ.Заказ.ВладелецТовара = ПараметрыКонтрагентовСрезПоследних.Контрагент
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ВТ.Приоритет");
	Запрос.УстановитьПараметр("Штрихкод", Штрихкод);
	Рез = Запрос.Выполнить().Выбрать();
	
	Если Рез.Следующий() Тогда
		
		Заказ = Рез.Заказ;
		
		Если Рез.УчетПоМестам Тогда // ------------ ПО МЕСТАМ
			
			Най = Объект.ЗаказыПоМестам.НайтиСтроки(Новый Структура("Заказ", Заказ));
			
			Если Най.Количество() Тогда // заказ есть в таблице
				
				Для каждого Ст Из Най Цикл			
					Если СокрЛП(Ст.Штрихкод) = СокрЛП(Штрихкод) Тогда	
						Ст.Собрано = Истина;					
					КонецЕсли;				
				КонецЦикла;			
			
			Иначе  // заказа нет в таблице
				
				ЗапросДанные = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
				                            |	МестаПоЗаказам.Ссылка КАК Место,
				                            |	МестаПоЗаказам.Заказ КАК Заказ,
				                            |	МестаПоЗаказам.Штрихкод КАК Штрихкод,
				                            |	ВЫБОР
				                            |		КОГДА МестаПоЗаказам.Штрихкод = &Штрихкод
				                            |			ТОГДА ИСТИНА
				                            |		ИНАЧЕ ЛОЖЬ
				                            |	КОНЕЦ КАК Собрано,
				                            |	МестаПоЗаказам.Заказ.ВладелецТовара КАК Контрагент
				                            |ИЗ
				                            |	Справочник.МестаПоЗаказам КАК МестаПоЗаказам
				                            |ГДЕ
				                            |	МестаПоЗаказам.Заказ = &Заказ");
				ЗапросДанные.УстановитьПараметр("Заказ", Заказ);
				ЗапросДанные.УстановитьПараметр("Штрихкод", Штрихкод);
				РезДанныеТЗ = ЗапросДанные.Выполнить().Выгрузить();	
				
				Для каждого Стр Из РезДанныеТЗ Цикл			
					НСтр = Объект.ЗаказыПоМестам.Добавить();
					ЗаполнитьЗначенияСвойств(НСтр, Стр);		
				КонецЦикла;			
			
			КонецЕсли;
												
		Иначе  // ------------ БЕЗ УЧЕТА МЕСТ	
			
			Най = Объект.ЗаказыНеПоМестам.НайтиСтроки(Новый Структура("Заказ", Заказ));
			
			Если Най.Количество() Тогда // заказ есть в таблице
				
				Для каждого Ст Из Най Цикл			
					Ст.МестСобрано = Ст.МестСобрано + 1;					
				КонецЦикла;			
			
			Иначе  // заказа нет в таблице
			
				НСтр = Объект.ЗаказыНеПоМестам.Добавить();	
				НСтр.Заказ = Заказ;
				НСтр.Контрагент = Заказ.ВладелецТовара;
				НСтр.КоличествоМест = Заказ.КоличествоМест;	
				НСтр.МестСобрано = 1;
				
			КонецЕсли;
			
		КонецЕсли;		
		
		Модифицированность = Истина;

	Иначе
		//Сообщить("Штрихкод не распознан");
	КонецЕсли;
				

КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.ЗаказыНеПоМестам.ВыделенныеСтроки.Очистить();
	Элементы.ЗаказыПоМестам.ВыделенныеСтроки.Очистить();
	Элементы.ЗаказыНеПоМестам.ТекущийЭлемент = Неопределено;
	Элементы.ЗаказыПоМестам.ТекущийЭлемент = Неопределено;
	
	
	//ПолучитьСерверТО().ПодключитьКлиента(ЭтаФорма);
	
КонецПроцедуры


&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	//ПолучитьСерверТО().ОтключитьКлиента(ЭтаФорма);
	
КонецПроцедуры


&НаКлиенте
Процедура ДобавитьЗаказ(Команда)
		
	Подсказка = "Введите номер заказа";
	Оповещение = Новый ОписаниеОповещения("ПослеВводаСтроки", ЭтотОбъект);
	ПоказатьВводСтроки(Оповещение, "", Подсказка, 0, Ложь);	
	
КонецПроцедуры


&НаКлиенте
Процедура ПослеВводаСтроки(Строка, Параметры) Экспорт
	
    Если НЕ Строка = Неопределено Тогда			
		ОбработатьШКНаСервере(СокрЛП(Строка));				
	КонецЕсли;	
	
КонецПроцедуры
